In [19]:
import pandas as pd

# Lade die CSV-Datei
df = pd.read_csv('feeds.csv')

# Gib die Daten aus
print(df)

                      created_at  entry_id    field1     field2   field3  \
0      2023-04-01T19:33:45+02:00         1  25.00000  310.00000  7.49650
1      2023-04-01T19:34:15+02:00         2  25.00000  305.00000  7.65190
2      2023-04-01T19:34:46+02:00         3  25.00000  312.00000  7.70370
3      2023-04-01T19:35:17+02:00         4  25.00000  307.00000  7.78140
4      2023-04-01T19:35:47+02:00         5  25.00000  303.00000  7.75550
...                          ...       ...       ...        ...      ...
34914  2024-05-26T12:32:16+02:00     34915  24.82812  273.68271  8.17171
34915  2024-05-26T13:02:49+02:00     34916  24.84063  274.79489  8.14296
34916  2024-05-26T13:33:22+02:00     34917  24.85813  275.27740  8.16058
34917  2024-05-26T14:03:56+02:00     34918  24.87125  275.26328  8.15488
34918  2024-05-26T14:34:29+02:00     34919  24.87875  274.31482  8.11810

       latitude  longitude  elevation  status
0           NaN        NaN        NaN     NaN
1           NaN        NaN        NaN     NaN
2           NaN        NaN        NaN     NaN
3           NaN        NaN        NaN     NaN
4           NaN        NaN        NaN     NaN
...         ...        ...        ...     ...
34914       NaN        NaN        NaN     NaN
34915       NaN        NaN        NaN     NaN
34916       NaN        NaN        NaN     NaN
34917       NaN        NaN        NaN     NaN
34918       NaN        NaN        NaN     NaN

[34919 rows x 9 columns]

In [20]:
df = df.drop(columns=['entry_id', 'latitude', 'longitude', 'elevation', 'status'])

In [21]:
df = df.rename(columns={'field1': 'Temperatur', 'field2': 'TDS(ppm)', 'field3': 'pH'})

In [22]:
len(df)

34919

In [23]:
df

                      created_at  Temperatur   TDS(ppm)       pH
0      2023-04-01T19:33:45+02:00    25.00000  310.00000  7.49650
1      2023-04-01T19:34:15+02:00    25.00000  305.00000  7.65190
2      2023-04-01T19:34:46+02:00    25.00000  312.00000  7.70370
3      2023-04-01T19:35:17+02:00    25.00000  307.00000  7.78140
4      2023-04-01T19:35:47+02:00    25.00000  303.00000  7.75550
...                          ...         ...        ...      ...
34914  2024-05-26T12:32:16+02:00    24.82812  273.68271  8.17171
34915  2024-05-26T13:02:49+02:00    24.84063  274.79489  8.14296
34916  2024-05-26T13:33:22+02:00    24.85813  275.27740  8.16058
34917  2024-05-26T14:03:56+02:00    24.87125  275.26328  8.15488
34918  2024-05-26T14:34:29+02:00    24.87875  274.31482  8.11810

[34919 rows x 4 columns]

In [24]:
from datetime import datetime

def convert_date_format(date_str):
    # Umwandlung des Datums in ein datetime-Objekt
    date_obj = datetime.fromisoformat(date_str)
    # Formatierung des datetime-Objekts in das gewünschte Format
    return date_obj.strftime("%Y-%m-%d %H:%M:%S.%f")

In [25]:
df['created_at'] = df['created_at'].apply(convert_date_format)

In [26]:
df

                       created_at  Temperatur   TDS(ppm)       pH
0      2023-04-01 19:33:45.000000    25.00000  310.00000  7.49650
1      2023-04-01 19:34:15.000000    25.00000  305.00000  7.65190
2      2023-04-01 19:34:46.000000    25.00000  312.00000  7.70370
3      2023-04-01 19:35:17.000000    25.00000  307.00000  7.78140
4      2023-04-01 19:35:47.000000    25.00000  303.00000  7.75550
...                           ...         ...        ...      ...
34914  2024-05-26 12:32:16.000000    24.82812  273.68271  8.17171
34915  2024-05-26 13:02:49.000000    24.84063  274.79489  8.14296
34916  2024-05-26 13:33:22.000000    24.85813  275.27740  8.16058
34917  2024-05-26 14:03:56.000000    24.87125  275.26328  8.15488
34918  2024-05-26 14:34:29.000000    24.87875  274.31482  8.11810

[34919 rows x 4 columns]

In [29]:
df.to_csv('filtered_feeds.csv', index=False, sep=";")